---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAltitudeValue
source: html/2034c327-6476-a6a6-8c5e-ffacdf235a8c.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ViewSolarstudyLightingAltitudeValue Property

"Lighting altitude"

## Syntax (C#)
```csharp
public static ForgeTypeId ViewSolarstudyLightingAltitudeValue { get; }
```